src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Результаты</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаДействияС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаДействияПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СоимостьЧасаРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаСервере
Процедура ФормированиеРТНаМесяца()
	
	//---//алгоритм должен выполняться с использованием механизма длительных операций БСП,
	
	//---//если Реализация за выбранный месяц уже создана, то обработка не должна создавать вторую,
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты, 0) КАК ВКМ_СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДоговораДействующие
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И ДоговорыКонтрагентов.ВКМ_ДатаДействияС <= &КонецПериода
	|	И ДоговорыКонтрагентов.ВКМ_ДатаДействияПо >= &НачалоПериода
	|	И ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	ВТ_ДоговораДействующие КАК ВТ_ДоговораДействующие,
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И РеализацияТоваровУслуг.Договор В
	|			(ВЫБРАТЬ
	|				ВТ_ДоговораДействующие.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_ДоговораДействующие КАК Договор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговораДействующие.Ссылка КАК СсылкаДОГ,
	|	ВТ_ДоговораДействующие.Владелец КАК ВладелецДОГ,
	|	ЕСТЬNULL(ВТ_ДоговораДействующие.ВКМ_СуммаАбонентскойПлаты, 0) КАК ВКМ_СуммаАбонентскойПлатыДОГ,
	|	ВТ_ДоговораДействующие.Организация КАК ОрганизацияДОГ,
	|	ВТ_Реализации.Ссылка КАК СсылкаРТ
	|ИЗ
	|	ВТ_ДоговораДействующие КАК ВТ_ДоговораДействующие
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО ВТ_ДоговораДействующие.Ссылка = ВТ_Реализации.Договор";
	
	Период = Объект.Период;
	КонецПериода = КонецМесяца(Период);
	НачалоПериода = НачалоМесяца(Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Объект.Результаты.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Договор = Выборка.СсылкаДОГ;
		Владелец = Выборка.ВладелецДОГ;
		Организация = Выборка.ОрганизацияДОГ;
		СтрокаТЧ = Объект.Результаты.Добавить();
		СтрокаТЧ.Договор = Договор;
		
		ШапкаСтруктура = Новый Структура;
		ШапкаСтруктура.Вставить("Контрагент",Владелец);
		ШапкаСтруктура.Вставить("Организация",Организация);
		ШапкаСтруктура.Вставить("Договор",Договор);
		ШапкаСтруктура.Вставить("СсылкаРТ",Выборка.СсылкаРТ);
		ШапкаСтруктура.Вставить("Период",Период);
		РеализацияТоваров = СоздатьДокуметРТПоДоговору(ШапкаСтруктура);
		
		Если РеализацияТоваров <> Неопределено Тогда
			СтрокаТЧ.Документ = РеализацияТоваров;
		Иначе
			Продолжить
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// ...при создании Реализации необходимо вызывать стандартный алгоритм заполнения
Функция СоздатьДокуметРТПоДоговору(ШапкаСтруктура);
	
	//ШапкаСтруктура("Контрагент",Контрагент);
	//ШапкаСтруктура("Организация",Организация);
	//ШапкаСтруктура("Договор",Договор);
	//ШапкаСтруктура("СсылкаРТ",Выборка.СсылкаРТ);
	//ШапкаСтруктура("Период",Период);
	
	СсылкаРТ = ШапкаСтруктура.СсылкаРТ;
	// ...если Реализация за выбранный месяц уже создана, то обработка не должна создавать вторую
	Создать = Ложь;
	Если НЕ ЗначениеЗаполнено(СсылкаРТ) ИЛИ СсылкаРТ = Null Тогда
		Создать = Истина;
	КонецЕсли;
	
	Если Создать Тогда
		Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		
		
		ЗаполнитьЗначенияСвойств(Документ,ШапкаСтруктура); 
		Документ.Дата = ТекущаяДата(); 
		Документ.Комментарий = СтрШаблон("Создан по договору %1 за %2.",ШапкаСтруктура.Договор, Формат(ШапкаСтруктура.Период,"ДФ='MMMM yyyy ''г.'''"));
		Документ.Записать();
	Иначе
		Документ = СсылкаРТ.ПолучитьОбъект();
	КонецЕсли;
	
	// ...для заполнения Реализации необходимо использовать метод модуля объекта Реализации ВыполнитьАвтозаполнение,
	Документ.ВКМ_ВыполнитьАвтозаполнение(Документ);
	
	Документ.Записать();
	
	Если Документ.ПроверитьЗаполнение() Тогда
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		СообщениеПоДок = Новый СообщениеПользователю;
		СообщениеПоДок.УстановитьДанные(Документ);
		СообщениеПоДок.Текст = СтрШаблон("Документ %1, НЕ проведен! т.к. не прошел проверку заполнения.",Документ);
		СообщениеПоДок.Сообщить();
	КонецЕсли;
	Возврат Документ.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Объект.Результаты.Очистить();
	
	ИДЗадания = "";
	Индикатор = 0;
	СтрокаСостояния = "";
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("УИД", УникальныйИдентификатор);
	ПараметрыЗапуска.Вставить("Период", Объект.Период); 
	ПараметрыЗапуска.Вставить("ТЗнчРезультатыАдресВХ", АдресВХ); 
	
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска);
	ИДЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;
	
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал  = 0;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект), ПараметрыОжидания);
	Объект.Результаты.Очистить();
КонецПроцедуры

&НаКлиенте
Функция ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт
	
	ОтключитьОбработчикОжидания("ОбработчикОжиданияИндикатор");
	
	Если Результат = Неопределено Тогда
		Результат.Статус = "хм...";
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		ЭтаФорма.СтрокаСостояния = "Ошибка";
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		ЭтаФорма.Индикатор = 100;
		ЭтаФорма.СтрокаСостояния = "Выполнено";
	КонецЕсли;
	ОбновитьТЧРезультаты();   
	
КонецФункции    

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска)
	
	НаименованиеЗадания = "Формирование РТ за месяц";
	
	ВыполняемыйМетод = "ВКМ_ФормированиеРТНаМесяц.ФормированиеДокументов";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресВХ = ПоместитьВоВременноеХранилище(Неопределено,УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьТЧРезультатыНаСервере() 
	
	ТЗнчРезультат = ПолучитьИзВременногоХранилища(АдресВХ);
	Объект.Результаты.Загрузить(ТЗнчРезультат);
	ТЧРезультаты.Загрузить(ТЗнчРезультат); 
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТЧРезультаты() 
	
	ОбновитьТЧРезультатыНаСервере();   
	
КонецПроцедуры
